{
  "@context": {
    "qm": "http://qualitymatters.org/standards/hej/7th-ed/",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "QualityStandard": "http://example.org/di-qa#QualityStandard",
    "GeneralQualityStandard": "http://example.org/di-qa#GeneralQualityStandard",
    "identifier": "http://example.org/di-qa#identifier",
    "name": "http://example.org/di-qa#name",
    "description": "http://example.org/di-qa#description",
    "points": {
      "@id": "http://example.org/di-qa#points",
      "@type": "xsd:integer"
    },
    "belongsToGeneralStandard": {
      "@id": "http://example.org/di-qa#belongsToGeneralStandard",
      "@type": "@id"
    }
  },
  "@graph": [
    {
      "@id": "qm:standard/GS1/1.1",
      "@type": "QualityStandard",
      "identifier": "1.1",
      "name": "Instructions make clear how to get started and where to find various course components.",
      "description": "Information posted at the beginning of the course indicates what to do first, provides a general course overview and detailed navigational instructions, and encourages the learner to explore the course site. Instructors may choose to incorporate some of this information in the course syllabus or other course documents. A useful feature is a \"Read Me First\" or \"Start Here\" button or icon on the course home page, linking learners to introductory information.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS1",
        "@type": "GeneralQualityStandard",
        "identifier": "GS1",
        "name": "Course Overview and Introduction"
      }
    },
    {
      "@id": "qm:standard/GS1/1.2",
      "@type": "QualityStandard",
      "identifier": "1.2",
      "name": "Learners are introduced to the purpose and structure of the course.",
      "description": "Information is provided in the course site to help learners understand the purpose of the course and how the learning process is structured and carried out, including the course schedule, explanation of the delivery modality (e.g., online or hybrid), modes of communication and participation, types of learning activities, and how learning will be assessed. Information may also include explanations of the purpose of specific course activities, such as to build community, to expand perspectives, or to foster inclusivity and belonging.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS1",
        "@type": "GeneralQualityStandard",
        "identifier": "GS1",
        "name": "Course Overview and Introduction"
      }
    },
    {
      "@id": "qm:standard/GS1/1.3",
      "@type": "QualityStandard",
      "identifier": "1.3",
      "name": "Communication guidelines for the course are clearly stated.",
      "description": "Guidelines for communication (sometimes referred to as \"community guidelines\") are clearly stated in the course syllabus or other course documents. Forms of communication may include written, oral, and/or visual. Communication methods may include email, discussion forums, assignments, synchronous course sessions, and other interactions or collaborations. As behavior within the learning community is culturally and contextually influenced, it is important to be explicit about expectations for communication within the course. Learners may be invited to contribute to forming the course's social contract or community guidelines.",
      "points": 2,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS1",
        "@type": "GeneralQualityStandard",
        "identifier": "GS1",
        "name": "Course Overview and Introduction"
      }
    },
    {
      "@id": "qm:standard/GS1/1.4",
      "@type": "QualityStandard",
      "identifier": "1.4",
      "name": "Course and institutional policies with which the learner is expected to comply are clearly stated within the course, or a link to current policies is provided.",
      "description": "Course and institutional policies may address such matters as student conduct, academic integrity, establishing attendance, the grade of \"Incomplete,\" withdrawal without penalty, confidentiality in the classroom, diversity, equity, and inclusion policies or statements (including religious accommodations), provisions for military service members and veterans, student grievances, electronic communication, proctoring, accessibility (see also Specific Review Standard 7.2), and others. Confirm that the policies are clearly explained and the policy statements themselves, or a direct link to them, are prominently located in the course.",
      "points": 2,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS1",
        "@type": "GeneralQualityStandard",
        "identifier": "GS1",
        "name": "Course Overview and Introduction"
      }
    },
    {
      "@id": "qm:standard/GS1/1.5",
      "@type": "QualityStandard",
      "identifier": "1.5",
      "name": "Minimum technology requirements for the course are clearly stated, and information on how to obtain the technologies is provided.",
      "description": "The word \"technologies\" covers a wide range, including hardware, software, peripherals (webcams, microphones, etc.), subscriptions, plug-ins, and mobile applications (apps). The technologies required to complete course activities are clearly listed. Course information specifies which course activities require computer use and which may be completed with different types of hardware (mobile devices vs. computers) and/or software. Learners are provided with detailed information on where and how they can obtain the technologies required for the course.",
      "points": 2,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS1",
        "@type": "GeneralQualityStandard",
        "identifier": "GS1",
        "name": "Course Overview and Introduction"
      }
    },
    {
      "@id": "qm:standard/GS1/1.6",
      "@type": "QualityStandard",
      "identifier": "1.6",
      "name": "Technical skills and digital information literacy skills expected of the learner are clearly stated.",
      "description": "General as well as course-specific technical skills learners must have to succeed in the course are specified. Digital information literacy refers to the ability to locate, evaluate, apply, create, and communicate knowledge using technology.",
      "points": 1,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS1",
        "@type": "GeneralQualityStandard",
        "identifier": "GS1",
        "name": "Course Overview and Introduction"
      }
    },
    {
      "@id": "qm:standard/GS1/1.7",
      "@type": "QualityStandard",
      "identifier": "1.7",
      "name": "Required prior knowledge in the discipline and/or any specific competencies are clearly stated in the course site.",
      "description": "Required prior knowledge and experience help learners connect new subject matter with their existing knowledge. Prior knowledge is commonly referred to as prerequisite knowledge. Information regarding prior knowledge and experience for learner success in the course is clearly explained and prominently located within the course, in documents linked to the course, or in supporting material provided to the learner by another means.",
      "points": 1,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS1",
        "@type": "GeneralQualityStandard",
        "identifier": "GS1",
        "name": "Course Overview and Introduction"
      }
    },
    {
      "@id": "qm:standard/GS1/1.8",
      "@type": "QualityStandard",
      "identifier": "1.8",
      "name": "The self-introduction by the instructor is welcoming and is available in the course site.",
      "description": "The instructor introduction establishes a sense of community and connection between the instructor and the learners. It presents the instructor as personable and approachable and includes basic information such as the instructor's name, title, photo or other visual representation, field of expertise, email address, phone number, and office hours (virtual or on campus).",
      "points": 1,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS1",
        "@type": "GeneralQualityStandard",
        "identifier": "GS1",
        "name": "Course Overview and Introduction"
      }
    },
    {
      "@id": "qm:standard/GS1/1.9",
      "@type": "QualityStandard",
      "identifier": "1.9",
      "name": "Learners have the opportunity to introduce themselves.",
      "description": "Learner introductions at the beginning of the course help to create a welcoming learning environment and a sense of community. Learners are asked to introduce themselves and are given guidance on where and how to do so.",
      "points": 1,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS1",
        "@type": "GeneralQualityStandard",
        "identifier": "GS1",
        "name": "Course Overview and Introduction"
      }
    },
    {
      "@id": "qm:standard/GS2/2.1",
      "@type": "QualityStandard",
      "identifier": "2.1",
      "name": "The course-level learning objectives describe outcomes that are measurable.",
      "description": "Measurable course-level learning objectives precisely and clearly describe what learners will be able to do if they successfully complete the course. Course-level objectives describe desired learner achievement using terms that are specific and observable enough to be measured by the instructor. At some institutions, learning objectives may be called \"competencies\" or \"learning outcomes.\"",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS2",
        "@type": "GeneralQualityStandard",
        "identifier": "GS2",
        "name": "Learning Objectives (Competencies)"
      }
    },
    {
      "@id": "qm:standard/GS2/2.2",
      "@type": "QualityStandard",
      "identifier": "2.2",
      "name": "The module/unit-level learning objectives describe outcomes that are measurable and consistent with the course-level objectives.",
      "description": "Learning objectives at the module/unit-level align with and are more specific than course-level learning objectives. The module/unit-level learning objectives describe learner proficiency in specific, observable terms and in smaller, discrete pieces. The objectives describe the specific competencies, skills, and knowledge learners are able to demonstrate at regular intervals throughout the course. The module/unit-level objectives are aligned with the course-level objectives.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS2",
        "@type": "GeneralQualityStandard",
        "identifier": "GS2",
        "name": "Learning Objectives (Competencies)"
      }
    },
    {
      "@id": "qm:standard/GS2/2.3",
      "@type": "QualityStandard",
      "identifier": "2.3",
      "name": "Learning objectives are clearly stated, are learner-centered, and are prominently located in the course.",
      "description": "The course and module/unit-level learning objectives are clearly stated. The use of educational or discipline jargon, unexplained terminology, and unnecessarily complex language is avoided. The learning objectives are learner-centered. Learning objectives describe what learners will be able to do rather than list what is taught in the course. They are written in a way that allows learners, including learners with diverse linguistic backgrounds, to easily grasp their meaning and the learning outcomes expected. They are prominently located in the course site.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS2",
        "@type": "GeneralQualityStandard",
        "identifier": "GS2",
        "name": "Learning Objectives (Competencies)"
      }
    },
    {
      "@id": "qm:standard/GS2/2.4",
      "@type": "QualityStandard",
      "identifier": "2.4",
      "name": "The relationship between learning objectives, learning activities, and assessments is made clear.",
      "description": "Confirm that the connection between the learning objectives and assigned learning activities, and assessments, is clearly conveyed, whether through text, a diagram, or some other means. The relationship between learning objectives, learning activities, and assessments, is explicit. This explicitness enables learners to visualize how the learning activities and assessments are directly connected to the objectives. The purpose of the activities and assessments is explained in terms of the learning objectives.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS2",
        "@type": "GeneralQualityStandard",
        "identifier": "GS2",
        "name": "Learning Objectives (Competencies)"
      }
    },
    {
      "@id": "qm:standard/GS2/2.5",
      "@type": "QualityStandard",
      "identifier": "2.5",
      "name": "The learning objectives are suited to and reflect the level of the course.",
      "description": "The expected level of achievement, as outlined in the learning objectives, is appropriate to the type and level of the course. Taxonomies that describe levels of learning can be helpful to reviewers in determining whether the objectives correspond to the level of the course.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS2",
        "@type": "GeneralQualityStandard",
        "identifier": "GS2",
        "name": "Learning Objectives (Competencies)"
      }
    },
    {
      "@id": "qm:standard/GS3/3.1",
      "@type": "QualityStandard",
      "identifier": "3.1",
      "name": "The assessments measure the achievement of the stated learning objectives.",
      "description": "Course assessments (ways of confirming learner progress and achievement) are consistent with the course and module/unit-level learning objectives (2.1 and 2.2) by measuring learning progress or achievement. Instructional materials (4.1), learning activities (5.1), and course tools (6.1) support the learning objectives and enable learners to be successful on the assessments.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS3",
        "@type": "GeneralQualityStandard",
        "identifier": "GS3",
        "name": "Assessment and Measurement"
      }
    },
    {
      "@id": "qm:standard/GS3/3.2",
      "@type": "QualityStandard",
      "identifier": "3.2",
      "name": "The course grading policy is stated clearly, available at the beginning of the course, and consistent throughout the course site.",
      "description": "A clear, written statement at the beginning of the course fully explains to the learner how the course grades are calculated. Depending on the grading system used, points, percentages, and weights for each component of the course grade are clearly stated, and the relationship(s) between points, percentages, weights, and letter grades are explained. If an alternative grading approach is used, the approach is clearly explained, including how work will be evaluated, and by whom. Late work is addressed in the grading policy.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS3",
        "@type": "GeneralQualityStandard",
        "identifier": "GS3",
        "name": "Assessment and Measurement"
      }
    },
    {
      "@id": "qm:standard/GS3/3.3",
      "@type": "QualityStandard",
      "identifier": "3.3",
      "name": "Specific and descriptive criteria are provided for the evaluation of learners' work, and their connection to the course grading policy is clearly explained.",
      "description": "Learners are provided with a clear and complete description of the criteria that will be used to evaluate their work in the course. Evaluation criteria are provided to learners prior to beginning a particular assignment or assessment. The description or statement of criteria provides learners with clear guidance on the instructor's expectations and on the required components of coursework and participation.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS3",
        "@type": "GeneralQualityStandard",
        "identifier": "GS3",
        "name": "Assessment and Measurement"
      }
    },
    {
      "@id": "qm:standard/GS3/3.4",
      "@type": "QualityStandard",
      "identifier": "3.4",
      "name": "The course includes multiple types of assessments that are sequenced and suited to the level of the course.",
      "description": "Assessments provide multiple ways for learners to demonstrate progress and achievement and are designed to accommodate diverse learners. Courses might use a combination of assessment types. The assessments are sequenced in a way that enable learners to build on previous knowledge and skills gained in this course and prerequisite courses. Assessments are paced to give learners adequate time to complete work in a thoughtful manner and demonstrate learning achievement.",
      "points": 2,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS3",
        "@type": "GeneralQualityStandard",
        "identifier": "GS3",
        "name": "Assessment and Measurement"
      }
    },
    {
      "@id": "qm:standard/GS3/3.5",
      "@type": "QualityStandard",
      "identifier": "3.5",
      "name": "The types and timing of assessments provide learners with multiple opportunities to track their learning progress with timely feedback.",
      "description": "Smaller, lower-stakes assessments provide learners with opportunities to receive timely feedback that can be used to track learning progress and improve learning achievement. Additionally, learning is enhanced if learners receive frequent, substantive, and timely feedback. The feedback may come from the instructor directly, from assessments that have feedback built into them, or from other learners.",
      "points": 2,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS3",
        "@type": "GeneralQualityStandard",
        "identifier": "GS3",
        "name": "Assessment and Measurement"
      }
    },
    {
      "@id": "qm:standard/GS3/3.6",
      "@type": "QualityStandard",
      "identifier": "3.6",
      "name": "The assessments provide guidance to the learner about how to uphold academic integrity.",
      "description": "Integrity in educational work enables communities of learners to interact in a spirit of trust, honesty, and fairness. Learners, particularly in online courses, benefit from specific and contextualized information about how to comply with institutional academic integrity policies and standards (see Specific Review Standard 1.4) as they complete assessments in the course. This guidance enables learners to apply abstract principles of academic integrity to real situations within the course (and discipline).",
      "points": 1,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS3",
        "@type": "GeneralQualityStandard",
        "identifier": "GS3",
        "name": "Assessment and Measurement"
      }
    },
    {
      "@id": "qm:standard/GS4/4.1",
      "@type": "QualityStandard",
      "identifier": "4.1",
      "name": "The instructional materials contribute to the achievement of the stated learning objectives.",
      "description": "Instructional materials align with the learning objectives to provide the information and resources learners need to achieve the stated learning objectives. They may include but are not limited to textbooks, openly licensed materials (e.g., open-source, open educational resources), publisher- or instructor-created materials, slide presentations and interactive content (such as simulations), expert lectures, videos, images, diagrams, and websites.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS4",
        "@type": "GeneralQualityStandard",
        "identifier": "GS4",
        "name": "Instructional Materials"
      }
    },
    {
      "@id": "qm:standard/GS4/4.2",
      "@type": "QualityStandard",
      "identifier": "4.2",
      "name": "The relationship between the use of instructional materials in the course and completion of learning activities and assessments is clearly explained.",
      "description": "Learners are provided with an explanation of how the instructional materials prepare them to complete learning activities and assessments. If optional instructional materials are provided and their use is recommended in the course, the materials are labeled as optional. The relevance of required and optional instructional materials is explained.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS4",
        "@type": "GeneralQualityStandard",
        "identifier": "GS4",
        "name": "Instructional Materials"
      }
    },
    {
      "@id": "qm:standard/GS4/4.3",
      "@type": "QualityStandard",
      "identifier": "4.3",
      "name": "The course models the academic integrity expected of learners by providing both source references and permissions for use of instructional materials.",
      "description": "Instructional materials include source references, and permission has been obtained to utilize the materials in the course. Sources for materials used in the course are clearly identified with references. This expectation applies to instructor-created materials, journal articles, publisher materials, textbooks, images, graphic materials, tables, videos, audio recordings, websites, slides, and all forms of multimedia.",
      "points": 2,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS4",
        "@type": "GeneralQualityStandard",
        "identifier": "GS4",
        "name": "Instructional Materials"
      }
    },
    {
      "@id": "qm:standard/GS4/4.4",
      "@type": "QualityStandard",
      "identifier": "4.4",
      "name": "The instructional materials represent up-to-date theory and practice in the discipline.",
      "description": "The instructional materials represent current thinking, practice, and application in the discipline.",
      "points": 2,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS4",
        "@type": "GeneralQualityStandard",
        "identifier": "GS4",
        "name": "Instructional Materials"
      }
    },
    {
      "@id": "qm:standard/GS4/4.5",
      "@type": "QualityStandard",
      "identifier": "4.5",
      "name": "A variety of instructional materials is used in the course.",
      "description": "The course presents a variety of relevant instructional materials that may include textbooks and other publications, instructor-created resources, websites, and multimedia. Variety may take the form of different types of media used to deliver content. Variety may take the form of different perspectives and different representations of ideas. Variety may also appear in images representing different types of people.",
      "points": 2,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS4",
        "@type": "GeneralQualityStandard",
        "identifier": "GS4",
        "name": "Instructional Materials"
      }
    },
    {
      "@id": "qm:standard/GS5/5.1",
      "@type": "QualityStandard",
      "identifier": "5.1",
      "name": "The learning activities help learners achieve the stated objectives.",
      "description": "Learning activities provide reinforcement and promote achievement through interaction with the course content and learning community. Examples of activities include participating in class discussions, role-playing, virtual field trips, simulation exercises, scenario-based activities, and web scavenger hunts; watching videos with embedded check-in questions; creating outlines, concept maps, graphic organizers, and laboratory skills exercises; and completing guided lessons, practice quizzes and self-checks.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS5",
        "@type": "GeneralQualityStandard",
        "identifier": "GS5",
        "name": "Learning Activities and Learner Interaction"
      }
    },
    {
      "@id": "qm:standard/GS5/5.2",
      "@type": "QualityStandard",
      "identifier": "5.2",
      "name": "Learning activities provide opportunities for interactions that support active learning.",
      "description": "Interactive learning activities promote active learning and engagement through three types of interaction: learner-content, learner-instructor, and learner-learner. Meaningful interactions that promote learners' development of skills are designed as activities to support the course objectives and may vary with the subject matter, purpose, and level of the course. Active learning involves learners engaging by \"doing\" something, such as analyzing data, evaluating potential solutions to a problem, or applying concepts and information.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS5",
        "@type": "GeneralQualityStandard",
        "identifier": "GS5",
        "name": "Learning Activities and Learner Interaction"
      }
    },
    {
      "@id": "qm:standard/GS5/5.3",
      "@type": "QualityStandard",
      "identifier": "5.3",
      "name": "The instructor's plan for regular interaction with learners in substantive ways during the course is clearly stated.",
      "description": "A clear plan for instructor-learner interaction helps promote substantive interaction between instructors and learners during the course. The plan includes details regarding when learners can expect the instructor's responses to questions, at what intervals learners will receive substantive instructor feedback on assignments, and how the instructor has designed other regular feedback and communication opportunities into the course.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS5",
        "@type": "GeneralQualityStandard",
        "identifier": "GS5",
        "name": "Learning Activities and Learner Interaction"
      }
    },
    {
      "@id": "qm:standard/GS5/5.4",
      "@type": "QualityStandard",
      "identifier": "5.4",
      "name": "The requirements for learner interaction are clearly stated.",
      "description": "A clear explanation of the requirements for learner interaction helps learners plan and manage their class participation and is important for promoting learners' active involvement in the course. The statement of requirements also provides a basis for the instructor to evaluate learner participation. Reviewers, look for a clear statement of the instructor's expectations for learner participation in required course interactions (frequency, length, timeliness, etc.), including learner-learner interactions in assessments and activities, if relevant.",
      "points": 2,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS5",
        "@type": "GeneralQualityStandard",
        "identifier": "GS5",
        "name": "Learning Activities and Learner Interaction"
      }
    },
    {
      "@id": "qm:standard/GS6/6.1",
      "@type": "QualityStandard",
      "identifier": "6.1",
      "name": "The tools used in the course support the learning objectives.",
      "description": "Tools are types of software and applications that enable learner interaction and may be used for content delivery or providing feedback in the course; they may be included in or external to the learning management system (LMS). Clear information and instructions are provided regarding how the tools support the learning objectives. For example, a course that requires posting to a discussion forum makes it clear how the tools used for discussions support a learning objective. Tools are not used simply for their own sake.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS6",
        "@type": "GeneralQualityStandard",
        "identifier": "GS6",
        "name": "Course Technology"
      }
    },
    {
      "@id": "qm:standard/GS6/6.2",
      "@type": "QualityStandard",
      "identifier": "6.2",
      "name": "Course tools promote learner engagement and active learning.",
      "description": "Tools used in the course help learners actively engage in the learning process rather than passively absorb information. The selected course tools support active learning through learner-instructor, learner-content, and learner-learner interaction. Active learning tools that encourage learning by interacting, retrieving, discussing, investigating, and creating are evident.",
      "points": 2,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS6",
        "@type": "GeneralQualityStandard",
        "identifier": "GS6",
        "name": "Course Technology"
      }
    },
    {
      "@id": "qm:standard/GS6/6.3",
      "@type": "QualityStandard",
      "identifier": "6.3",
      "name": "A variety of technology is used in the course.",
      "description": "The course uses a variety of technology tools, such as videos, discussion forums, social media, mobile technologies, games, simulations, blogs, podcasts, and virtual worlds. Variety does not refer to a specific number, but indicates that different types of aligned technology are used in the course. Technology includes a wide array of different hardware, software, subscriptions, and plug-ins.",
      "points": 1,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS6",
        "@type": "GeneralQualityStandard",
        "identifier": "GS6",
        "name": "Course Technology"
      }
    },
    {
      "@id": "qm:standard/GS6/6.4",
      "@type": "QualityStandard",
      "identifier": "6.4",
      "name": "The course provides learners with information on protecting their data and privacy.",
      "description": "Course design, tool usage, and settings can enhance learner privacy. Steps learners can take to protect their privacy with course activities, tool usage, and interactions with others are provided. Tools used in the course (both instructor-selected and institutionally integrated) include links to the privacy policies provided by the creators of the tools.",
      "points": 1,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS6",
        "@type": "GeneralQualityStandard",
        "identifier": "GS6",
        "name": "Course Technology"
      }
    },
    {
      "@id": "qm:standard/GS7/7.1",
      "@type": "QualityStandard",
      "identifier": "7.1",
      "name": "The course instructions articulate or link to a clear description of the technical support offered and how to obtain it.",
      "description": "Technical support for learners differs from institution to institution and includes such information as how to log in, how to use the tools and features of the learning management system; and how to get help desk support. Technical support does not include help with course content or assignments or academic support services or student support services.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS7",
        "@type": "GeneralQualityStandard",
        "identifier": "GS7",
        "name": "Learner Support"
      }
    },
    {
      "@id": "qm:standard/GS7/7.2",
      "@type": "QualityStandard",
      "identifier": "7.2",
      "name": "Course instructions articulate or link to the institution's accessibility policies and accommodation services.",
      "description": "Accessibility policies or accommodation statements state that services and accommodations are available for learners with disabilities and inform the learner how such services may be obtained.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS7",
        "@type": "GeneralQualityStandard",
        "identifier": "GS7",
        "name": "Learner Support"
      }
    },
    {
      "@id": "qm:standard/GS7/7.3",
      "@type": "QualityStandard",
      "identifier": "7.3",
      "name": "Course instructions articulate or link to the institution's academic support services and resources that can help learners succeed in the course.",
      "description": "Academic support services and resources, and the scope of what they entail, differ from institution to institution. For the purposes of review, academic support services and resources may include an online orientation, access to library resources, a readiness assessment or survey, testing services, tutoring, non-native language services, writing and/or math centers, supplemental instruction programs, teaching assistants, and tutorials or other forms of guidance on activities.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS7",
        "@type": "GeneralQualityStandard",
        "identifier": "GS7",
        "name": "Learner Support"
      }
    },
    {
      "@id": "qm:standard/GS7/7.4",
      "@type": "QualityStandard",
      "identifier": "7.4",
      "name": "Course instructions articulate or link to the institution's student services and resources that can help learners succeed.",
      "description": "Student services and resources differ from institution to institution. For the purposes of this review, support services and resources include advising, registration, financial aid, veterans' services, student or campus life, mental health counseling, career services, online workshops, student organizations, and department services and resources.",
      "points": 1,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS7",
        "@type": "GeneralQualityStandard",
        "identifier": "GS7",
        "name": "Learner Support"
      }
    },
    {
      "@id": "qm:standard/GS8/8.1",
      "@type": "QualityStandard",
      "identifier": "8.1",
      "name": "Course navigation facilitates ease of use.",
      "description": "Navigation refers to the process of planning, controlling, and recording the movement of a learner from one place to another in the online course. Navigation throughout the course is consistent, logical, and efficient. Reviewers, confirm that the course's navigation strategies facilitate ease of movement through the course and course activities.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS8",
        "@type": "GeneralQualityStandard",
        "identifier": "GS8",
        "name": "Accessibility and Usability"
      }
    },
    {
      "@id": "qm:standard/GS8/8.2",
      "@type": "QualityStandard",
      "identifier": "8.2",
      "name": "The course design facilitates readability.",
      "description": "Course design elements maximize usability by facilitating readability and minimizing distractions. Readability is a measure of how easy it is to read and follow content. Readability includes content presentation as well as clarity and legibility of text.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS8",
        "@type": "GeneralQualityStandard",
        "identifier": "GS8",
        "name": "Accessibility and Usability"
      }
    },
    {
      "@id": "qm:standard/GS8/8.3",
      "@type": "QualityStandard",
      "identifier": "8.3",
      "name": "Text in the course is accessible.",
      "description": "Text may be found in files, documents, slides, learning management system (LMS) pages, and websites. Reviewers can use accessibility tools and checkers to assist in the review of the accessibility of the text. When the text in a course is accessible, learners benefit. For example, any learner can search an accessible PDF for keywords. Most learners can access content, complete activities, and interact with others without the need for accommodations.",
      "points": 3,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS8",
        "@type": "GeneralQualityStandard",
        "identifier": "GS8",
        "name": "Accessibility and Usability"
      }
    },
    {
      "@id": "qm:standard/GS8/8.4",
      "@type": "QualityStandard",
      "identifier": "8.4",
      "name": "Images in the course are accessible.",
      "description": "Images that are meaningful to the learning experience include alternative text (alt-text), long descriptions, or other means of description. Images that are decorative are marked as such. Images can be found in narrated slide presentations, web pages, documents, and within the LMS pages. Images, include, photographs, charts, graphs, infographics, maps, etc.",
      "points": 2,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS8",
        "@type": "GeneralQualityStandard",
        "identifier": "GS8",
        "name": "Accessibility and Usability"
      }
    },
    {
      "@id": "qm:standard/GS8/8.5",
      "@type": "QualityStandard",
      "identifier": "8.5",
      "name": "Video and audio content in the course is accessible.",
      "description": "Video and audio content can be found in videos, podcasts, narrated slide presentations, animations, simulations, and other multimedia. Video and audio content includes alternative means of access for learners through the addition of captions or transcripts with equivalent information. When video and audio in a course is accessible, most learners benefit.",
      "points": 2,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS8",
        "@type": "GeneralQualityStandard",
        "identifier": "GS8",
        "name": "Accessibility and Usability"
      }
    },
    {
      "@id": "qm:standard/GS8/8.6",
      "@type": "QualityStandard",
      "identifier": "8.6",
      "name": "Multimedia in the course is easy to use.",
      "description": "Multimedia includes the use or integration of various types of media such as images, audio, video, animations, and interactive components. Interactive elements integral to the content are cross-platform (PC, Mac) and cross-browser, or guidance is provided about the best browser to use. Learners are notified of any limitations, such as the need for specific browsers or high bandwidth requirements.",
      "points": 2,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS8",
        "@type": "GeneralQualityStandard",
        "identifier": "GS8",
        "name": "Accessibility and Usability"
      }
    },
    {
      "@id": "qm:standard/GS8/8.7",
      "@type": "QualityStandard",
      "identifier": "8.7",
      "name": "Vendor accessibility statements are provided for the technologies used in the course.",
      "description": "Learners have access to information on the accessibility of technologies used in the course, including the learning management system. This Specific Review Standard is met if the course includes a link to the vendor accessibility statement for each technology. If an accessibility statement does not exist for a particular technology, a statement is provided that the accessibility statement does not exist, along with contact information for the vendor.",
      "points": 1,
      "belongsToGeneralStandard": {
        "@id": "qm:standard/GS8",
        "@type": "GeneralQualityStandard",
        "identifier": "GS8",
        "name": "Accessibility and Usability"
      }
    }
  ]
}
